using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace YZ.Common
{
    public class PhoneLuck
    {

        private const string CACHE_PHONELUCK = "CACHE_PHONELUCK";

        #region Instance
        private static PhoneLuck _instance;
        private static object _syncObject = new object();
        public static PhoneLuck Instance
        {
            get
            {
                if (_instance == null)
                {
                    lock (_syncObject)
                    {
                        if (_instance == null)
                        {
                            _instance = new PhoneLuck();
                        }
                    }
                }
                return _instance;
            }
        }
        #endregion

        /// <summary>
        /// 号码运势
        /// </summary>
        /// <param name="number"></param>
        /// <returns></returns>
        public PhoneModel LuckTest(string strNumber)
        {
            PhoneModel model = new PhoneModel();
            strNumber = strNumber.Replace(" ", "");
            if (!ValidateHelper.IsNumber(strNumber))
            {
                model.Explain = "错误号码";
                return model;
            }

            if (strNumber.Length < 4)
            {
                model.Explain = "不是正确的号码";
                return model;
            }
            int number = 0;
            //最后四位
            if (strNumber.Length > 4) strNumber = strNumber.Remove(0, strNumber.Length - 4);
            number = Convert.ToInt16(strNumber);

            //求余
            var value = number % 80;
            //除以80
            //decimal fNum = (decimal)number / (decimal)80;
            //var value = (fNum - Math.Floor(fNum)) * 80;

            //if (value != Math.Floor(value))
            //{
            //    model.Explain = "终于不是整数了";
            //    return model;
            //}

            //手机号码吉祥如意表
            Dictionary<int, string> data = CacheHelper.Instance.GetItem<Dictionary<int, string>>(CACHE_PHONELUCK);
            if (data == null)
            {
                CacheHelper.Instance.addItem(CACHE_PHONELUCK, new PhoneLuck().LuckData(), CacheHelper.Expiration.OneDay);
                data = CacheHelper.Instance.GetItem<Dictionary<int, string>>(CACHE_PHONELUCK);
            }

            string[] v = data[(int)value].Split('|');
            model.Explain = v[0];
            model.Mark = v[1];

            return model;
        }

        public PhoneModel LuckTest2(string strNumber)
        {
            PhoneModel model = new PhoneModel();
            strNumber = strNumber.Replace(" ", "");
            if (!ValidateHelper.IsNumber(strNumber))
            {
                model.Explain = "错误号码";
                return model;
            }

            if (strNumber.Length < 4)
            {
                model.Explain = "不是正确的号码";
                return model;
            }
            int number = 0;
            //最后四位
            if (strNumber.Length > 4) strNumber = strNumber.Remove(0, strNumber.Length - 4);
            number = Convert.ToInt16(strNumber);

            //求余
            var value = number % 80;
            //除以80
            //decimal fNum = (decimal)number / (decimal)80;
            //var value = (fNum - Math.Floor(fNum)) * 80;

            //if (value != Math.Floor(value))
            //{
            //    model.Explain = "终于不是整数了";
            //    return model;
            //}

            //手机号码吉祥如意表
            Dictionary<int, string> data = CacheHelper.Instance.GetItem<Dictionary<int, string>>(CACHE_PHONELUCK);
            if (data == null)
            {
                CacheHelper.Instance.addItem(CACHE_PHONELUCK, new PhoneLuck().LuckData(), CacheHelper.Expiration.OneDay);
                data = CacheHelper.Instance.GetItem<Dictionary<int, string>>(CACHE_PHONELUCK);
            }

            string[] v = data[(int)value].Split('|');
            model.Explain = v[0];
            model.Mark = v[1];

            return model;
        }
        /// <summary>
        /// 性格测试
        /// </summary>
        /// <param name="number"></param>
        /// <returns></returns>
        public PhoneModel CharacterTest(string strNumber)
        {

            PhoneModel model = new PhoneModel();
            strNumber = strNumber.Replace(" ", "");
            if (!ValidateHelper.IsNumber(strNumber))
            {
                model.Explain = "错误号码";
                return model;
            }

            char[] c = strNumber.ToArray();

            //选出幸运数
            int v = 0;
            while (c.Length > 1)
            {
                v = 0;
                foreach (var i in c)
                {
                    v = v + Convert.ToInt16(i.ToString());
                }
                c = v.ToString().ToArray();
            }

            //解释
            switch (v)
            {
                case 1:
                    model.Explain = "要面包不要爱情";
                    model.Mark = "责任心重，尤其对工作充满热诚，是个彻头彻尾工作狂。但往往因为过分专注职务，而忽略身边的家人及朋友，是个宁要面包不需要爱情的理性主义者。";
                    break;
                case 2:
                    model.Explain = "不善表达/疑心重";
                    model.Mark = "在乎身边各人对自己的评价及观感，不善表达个人情感，是个先考虑别人感受，再作出相应配合的内敛一族。对于爱侣，经常存有怀疑之心。";
                    break;
                case 3:
                    model.Explain = "大胆行事冲动派";
                    model.Mark = "爱好追寻刺激，有不理后果大胆行事的倾向。崇尚自由奔放的恋爱，会拼尽全力爱一场，是就算明知无结果都在所不惜的冲动派。";
                    break;
                case 4:
                    model.Explain = "高度戒备难交心";
                    model.Mark = "经常处于戒备状态，对任何事都没法放松处理，孤僻性情难以交朋结友。对于爱情，就更加会慎重处理。任何人必须经过长期观察及通过连番考验，方会减除戒备与你交往。";
                    break;
                case 5:
                    model.Explain = "好奇心旺求知欲强";
                    model.Mark = "好奇心极度旺盛，求知欲又强，有打烂沙盘问到笃的锲而不舍精神。此外，你天生有语言天分，学习外文比一般人更易掌握。";
                    break;
                case 6:
                    model.Explain = "做事喜好凭直觉";
                    model.Mark = "有特强的第六灵感，性格率直无机心，深得朋辈爱戴。感情路上多采多姿。做事喜好凭个人直觉及预感做决定。";
                    break;
                case 7:
                    model.Explain = "独断独行/吸引人";
                    model.Mark = "为人独断独行，事事自行作主解决，鲜有求助他人。而这份独立个性，正正就是吸引异性的特质。但其实心底里，却是渴望有人可让他/她依赖。";
                    break;
                case 8:
                    model.Explain = "热情/善变梦想家";
                    model.Mark = "对人热情无遮掩，时常梦想可以谈一场戏剧性恋爱，亲身体会个中悲欢离合的动人经历，是个大梦想家。但对于感情却易变卦。";
                    break;
                case 9:
                    model.Explain = "自我牺牲/性格被动";
                    model.Mark = "习惯于无条件付出，从不祈求有回报，有为了成全他人不惜牺牲自己的情操。但讲到本身的爱情观，却流于被动，往往因为内敛而错过大好姻缘。";
                    break;
            }
            return model;
        }

        /// <summary>
        /// 手机号码吉祥如意表
        /// </summary>
        /// <returns></returns>
        private Dictionary<int, string> LuckData()
        {
            var dic = new Dictionary<int, string>();
            dic.Add(0, "您拥有非常人的能力，能够跳出三界外，不在五行中|吉");
            dic.Add(1, "大展鸿图，信用得固，无远弗界，可获成功|吉");
            dic.Add(2, "根基不固，摇摇欲坠，一盛一衰，劳而无功|凶");
            dic.Add(3, "根深蒂固，蒸蒸日上，如意吉祥，百事顺遂|吉");
            dic.Add(4, "坎坷前途，苦难折磨，非有毅力，难望成功|凶");
            dic.Add(5, "阴阳和合，生意欣荣，名利双收，后福重重|吉");
            dic.Add(6, "万宝云集，天降幸运，立志奋发，可成大功|吉");
            dic.Add(7, "专心经营，和气致祥，排除万难，必获成功|吉");
            dic.Add(8, "努力发达，贯彻志望，不忘进退，成功可期|吉");
            dic.Add(9, "虽抱奇才，有才无命，独营无力，财利无望|凶");
            dic.Add(10, "乌云遮月，暗淡无光，空费心力，徒劳无功|凶");
            dic.Add(11, "草木逢春，枯叶沾露，稳健着实，必得人望|吉");
            dic.Add(12, "薄弱无力，孤立无摇，外祥内苦，谋事难成|凶");
            dic.Add(13, "天赋吉运，能得人望，善用智慧，必获成功|吉");
            dic.Add(14, "忍得苦难，必有后福，是成是败，惟靠坚毅|凶");
            dic.Add(15, "谦恭做事，必得人和，大事成就，一定兴隆|吉");
            dic.Add(16, "能获众望，成就大业，名利双收，盟主四方|吉");
            dic.Add(17, "排除万难，有贵人助，把握时机，可得成功|吉");
            dic.Add(18, "经商做事，顺利昌隆，如能慎始，百事亨通|吉");
            dic.Add(19, "成功虽早，慎防空亏，内外不合，障碍重重|凶");
            dic.Add(20, "智高志大，历尽艰难，焦心忧劳，进退两难|凶");
            dic.Add(21, "专心经营，善用智慧，霜雪梅花，春来怒放|吉");
            dic.Add(22, "秋草逢霜，怀才不遇，忧愁怨苦，事不如意|凶");
            dic.Add(23, "旭日升天，名显四方，渐次进展，终成大业|吉");
            dic.Add(24, "锦绣前程，须靠自力，多用智谋，能奏大功|吉");
            dic.Add(25, "天时地利，再得人格，讲信修睦，即可成功|吉");
            dic.Add(26, "波澜起伏，千变万化，凌驾万难，必可成功|凶");
            dic.Add(27, "一成一败，一盛一衰，惟靠谨慎，可守成功|凶带吉");
            dic.Add(28, "鱼临旱地，难逃恶运，此数大凶，不如更名|凶");
            dic.Add(29, "如龙得云，青云直上，智谋奋进，才略奏功|吉");
            dic.Add(30, "吉凶参半，得失相伴，投机取巧，如赛一样|凶");
            dic.Add(31, "此数大吉，名利双收，渐进向上，大业成就|吉");
            dic.Add(32, "池中之龙，风云际会，一跃上天，成功可望|吉");
            dic.Add(33, "不可意气，善用智慧，如能慎始，必可昌隆|吉");
            dic.Add(34, "灾难不绝，难望成功，此数大凶，不如更名|凶");
            dic.Add(35, "中吉之数，进退保守，生意安稳，成就可期|吉");
            dic.Add(36, "波澜重迭，常陷穷困，动不如静，有才无命|凶");
            dic.Add(37, "逢凶化吉，吉人天相，风条雨顺，生意兴隆|吉");
            dic.Add(38, "名虽可得，利则难获，艺界发展，可望成功|凶带吉");
            dic.Add(39, "云开见月，虽有劳碌，光明坦途，指日可期|吉");
            dic.Add(40, "一胜一衰，浮沉不定，知难而退，自获天佑|吉带凶");
            dic.Add(41, "天赋吉运，德望兼备，继续努力，前途无限|吉");
            dic.Add(42, "事业不专，十九不成，专心进取，可望成功|吉带凶");
            dic.Add(43, "雨夜之花，外祥内苦，忍耐自重，转凶为吉|吉带凶");
            dic.Add(44, "虽用心计，事难遂愿，贪功好进，必招失败|凶");
            dic.Add(45, "杨柳遇春，绿叶发枝，冲破难关，一举成名|吉");
            dic.Add(46, "坎坷不平，艰难重重，若无耐心，难望有成|凶");
            dic.Add(47, "有贵人助，可成大业，虽遇不幸，浮沉不大|吉");
            dic.Add(48, "美化丰实，鹤立鸡群，名利俱全，繁荣富贵|吉");
            dic.Add(49, "遇吉则吉，遇凶则凶，惟靠谨慎，逢凶化吉|凶");
            dic.Add(50, "吉凶互见，一成一败，凶中有吉，吉中有凶|吉带凶");
            dic.Add(51, "一盛一衰，浮沉不常，自重自处，可保平安|吉带凶");
            dic.Add(52, "草木逢春，雨过天晴，渡过难关，即获成功|吉");
            dic.Add(53, "盛衰参半，外祥内苦，先吉后凶，先凶后吉|吉带凶");
            dic.Add(54, "虽倾全力，难望成功，此数大凶，最好改名|凶");
            dic.Add(55, "外观隆昌，内隐祸患，克服难关，开出泰运|吉带凶");
            dic.Add(56, "事与愿违，终难成功，欲速不达，有始有终|凶");
            dic.Add(57, "努力经营，时来运转，旷野枯草，春来花开|吉");
            dic.Add(58, "半凶半吉，浮沉多端，始凶终吉，能保成功|凶带吉");
            dic.Add(59, "遇事犹疑，难望成事，大刀阔斧，始可有成|凶");
            dic.Add(60, "黑暗无光，心迷意乱，出尔反尔，难定方针|凶");
            dic.Add(61, "云遮半月，百隐风波，应自谨慎，始保平安|吉带凶");
            dic.Add(62, "烦闷懊恼，事事难展，自防灾祸，始免困境|凶");
            dic.Add(63, "万物化育，繁荣之象，专心一意，始能成功|吉");
            dic.Add(64, "见异思迁，十九不成，徒劳无功，不如更名|凶");
            dic.Add(65, "吉运自来，能享盛名，把握机会，必获成功|吉");
            dic.Add(66, "黑夜漫长，进退维谷，内外不合，信用缺乏|凶");
            dic.Add(67, "时来运转，事事如意，功成名就，富贵自来|吉");
            dic.Add(68, "思虑周详，计划力行，不失先机，可望成功|吉");
            dic.Add(69, "动摇不安，常陷逆境，不得时运，难得利润|凶");
            dic.Add(70, "惨淡经营，难免贫困，此数不吉，最好改名|凶");
            dic.Add(71, "吉凶参半，惟赖勇气，贯彻力行，始可成功|吉带凶");
            dic.Add(72, "利害混集，凶多吉少，得而复失，难以安顺|凶");
            dic.Add(73, "安乐自来，自然吉祥，力行不懈，终必成功|吉");
            dic.Add(74, "利不及费，坐食山空，如无智谋，难望成功|凶");
            dic.Add(75, "吉中带凶，欲速不达，进不如守，可保安详|吉带凶");
            dic.Add(76, "此数大凶，破产之象，宜速改名，以避厄运|凶");
            dic.Add(77, "先苦后甘，先甘后苦，如能守成，不致失败|吉带凶");
            dic.Add(78, "有得有失，华而不实，须防劫财，始保平安|吉带凶");
            dic.Add(79, "如走夜路，前途无光，希望不大，劳而无功|凶");
            dic.Add(80, "得而复失，枉费心机，守成无贪，可保安稳|吉带凶");
            dic.Add(81, "最极之数，还本归元，能得繁业，发达成功|吉");

            return dic;
        }

    }

    public class PhoneModel
    {
        public PhoneModel()
        {
            //讲解
            Explain = "";
            //凶吉、解说
            Mark = "";
        }
        public string Explain { get; set; }
        public string Mark { get; set; }
    }
}
//手机号码吉凶算法
//运算方式如下：
//你的手机号码最后四位除以80，再减去整数部分（只留小数），再乘以80，就会得到一个数，这就是代表吉凶的数字，然后就去对号入座查表测之。
//例：①13XXXXX1234；                 ② 13936123456
//1234÷80=15.425；                    3456÷80=43.2
//15.425-15=0.425；                    43.2-43=0.2
//0.425×80=34；                       0.2×80=16
//（34）就是手机号码的吉凶数字；“34”为凶。
//（16）就是手机号码的吉凶数字；“16”为吉！
//(手机号码最后四位÷80-商的整数)×80=K，“K”查表测之。

//注：如果得数刚好是整数，小数部分为“0”，则此人拥有非常人的能力，能够跳出三界外，不在五行中，这样散仙级的人物，
//自然是：经常处于戒备状态，对任何事都没法放松处理，孤僻性情难以交朋结友。对于爱情，就更加会慎重处理。
//任何人必须经过你长期观察及通过连番考验，方会减除戒备与你交往。

//*姓名笔画总数，*电话号码总和，也可参考使用下表论吉凶。
//例：电话号码为7223456   7+2+2+3+4+5+6=29；“29”即是电话号码之吉数。
//例：13272804103   1＋3＋2＋7＋2＋8＋0＋4＋1＋0＋3=32（吉）
//41783203   4＋1＋7＋8＋3＋2＋0＋3=28（凶）；但按数理算为“吉”。
//电话号码之“总和”测算，准确率低，只可“参考使用”；按数理算为好！

//手机号码吉祥如意表（吉凶对照表）
//吉凶数字     解 释                                        备注

//    1        大展鸿图，信用得固，无远弗界，可获成功       吉
//    2        根基不固，摇摇欲坠，一盛一衰，劳而无功       凶
//    3        根深蒂固，蒸蒸日上，如意吉祥，百事顺遂       吉
//    4        坎坷前途，苦难折磨，非有毅力，难望成功       凶
//    5        阴阳和合，生意欣荣，名利双收，后福重重       吉
//    6        万宝云集，天降幸运，立志奋发，可成大功       吉
//    7        专心经营，和气致祥，排除万难，必获成功       吉
//    8        努力发达，贯彻志望，不忘进退，成功可期       吉
//    9        虽抱奇才，有才无命，独营无力，财利无望       凶
//    10       乌云遮月，暗淡无光，空费心力，徒劳无功       凶
//    11       草木逢春，枯叶沾露，稳健着实，必得人望       吉
//    12       薄弱无力，孤立无摇，外祥内苦，谋事难成       凶
//    13       天赋吉运，能得人望，善用智慧，必获成功       吉
//    14       忍得苦难，必有后福，是成是败，惟靠坚毅       凶
//    15       谦恭做事，必得人和，大事成就，一定兴隆       吉
//    16       能获众望，成就大业，名利双收，盟主四方       吉
//    17       排除万难，有贵人助，把握时机，可得成功       吉
//    18       经商做事，顺利昌隆，如能慎始，百事亨通       吉
//    19       成功虽早，慎防空亏，内外不合，障碍重重       凶
//    20       智高志大，历尽艰难，焦心忧劳，进退两难       凶
//    21       专心经营，善用智慧，霜雪梅花，春来怒放       吉
//    22       秋草逢霜，怀才不遇，忧愁怨苦，事不如意       凶
//    23       旭日升天，名显四方，渐次进展，终成大业       吉
//    24       锦绣前程，须靠自力，多用智谋，能奏大功       吉
//    25       天时地利，再得人格，讲信修睦，即可成功       吉
//    26       波澜起伏，千变万化，凌驾万难，必可成功       凶
//    27       一成一败，一盛一衰，惟靠谨慎，可守成功   凶带吉
//    28       鱼临旱地，难逃恶运，此数大凶，不如更名       凶
//    29       如龙得云，青云直上，智谋奋进，才略奏功       吉
//    30       吉凶参半，得失相伴，投机取巧，如赛一样       凶
//    31       此数大吉，名利双收，渐进向上，大业成就       吉
//    32       池中之龙，风云际会，一跃上天，成功可望       吉
//    33       不可意气，善用智慧，如能慎始，必可昌隆       吉
//    34       灾难不绝，难望成功，此数大凶，不如更名       凶
//    35       中吉之数，进退保守，生意安稳，成就可期       吉
//    36       波澜重迭，常陷穷困，动不如静，有才无命       凶
//    37       逢凶化吉，吉人天相，风条雨顺，生意兴隆       吉
//    38       名虽可得，利则难获，艺界发展，可望成功   凶带吉
//    39       云开见月，虽有劳碌，光明坦途，指日可期       吉
//    40       一胜一衰，浮沉不定，知难而退，自获天佑   吉带凶
//    41       天赋吉运，德望兼备，继续努力，前途无限       吉
//    42       事业不专，十九不成，专心进取，可望成功   吉带凶
//    43       雨夜之花，外祥内苦，忍耐自重，转凶为吉   吉带凶
//    44       虽用心计，事难遂愿，贪功好进，必招失败       凶
//    45       杨柳遇春，绿叶发枝，冲破难关，一举成名       吉
//    46       坎坷不平，艰难重重，若无耐心，难望有成       凶
//    47       有贵人助，可成大业，虽遇不幸，浮沉不大       吉
//    48       美化丰实，鹤立鸡群，名利俱全，繁荣富贵       吉
//    49       遇吉则吉，遇凶则凶，惟靠谨慎，逢凶化吉       凶
//    50       吉凶互见，一成一败，凶中有吉，吉中有凶   吉带凶
//    51       一盛一衰，浮沉不常，自重自处，可保平安   吉带凶
//    52       草木逢春，雨过天晴，渡过难关，即获成功       吉
//    53       盛衰参半，外祥内苦，先吉后凶，先凶后吉   吉带凶
//    54       虽倾全力，难望成功，此数大凶，最好改名       凶
//    55       外观隆昌，内隐祸患，克服难关，开出泰运   吉带凶
//    56       事与愿违，终难成功，欲速不达，有始有终       凶
//    57       努力经营，时来运转，旷野枯草，春来花开       吉
//    58       半凶半吉，浮沉多端，始凶终吉，能保成功   凶带吉
//    59       遇事犹疑，难望成事，大刀阔斧，始可有成       凶
//    60       黑暗无光，心迷意乱，出尔反尔，难定方针       凶
//    61       云遮半月，百隐风波，应自谨慎，始保平安   吉带凶
//    62       烦闷懊恼，事事难展，自防灾祸，始免困境       凶
//    63       万物化育，繁荣之象，专心一意，始能成功       吉
//    64       见异思迁，十九不成，徒劳无功，不如更名       凶
//    65       吉运自来，能享盛名，把握机会，必获成功       吉
//    66       黑夜漫长，进退维谷，内外不合，信用缺乏       凶
//    67       时来运转，事事如意，功成名就，富贵自来       吉
//    68       思虑周详，计划力行，不失先机，可望成功       吉
//    69       动摇不安，常陷逆境，不得时运，难得利润       凶
//    70       惨淡经营，难免贫困，此数不吉，最好改名       凶
//    71       吉凶参半，惟赖勇气，贯彻力行，始可成功   吉带凶
//    72       利害混集，凶多吉少，得而复失，难以安顺       凶
//    73       安乐自来，自然吉祥，力行不懈，终必成功       吉
//    74       利不及费，坐食山空，如无智谋，难望成功       凶
//    75       吉中带凶，欲速不达，进不如守，可保安详   吉带凶
//    76       此数大凶，破产之象，宜速改名，以避厄运       凶
//    77       先苦后甘，先甘后苦，如能守成，不致失败   吉带凶
//    78       有得有失，华而不实，须防劫财，始保平安   吉带凶
//    79       如走夜路，前途无光，希望不大，劳而无功       凶
//    80       得而复失，枉费心机，守成无贪，可保安稳   吉带凶
//    81       最极之数，还本归元，能得繁业，发达成功       吉

//数之始为一，再而三，三而九，至九已尽。象成于二，二而四，四而八，故八卦之象备矣。

//鼓动其生成化育之基本者，即基本数：自一至九之数之离合集散；现代科学之根底，亦不外于一切数之分合离集也。 

//九数相乘之九九共八十一数，是数理吉凶之数，非数目之数，所以其各数，含蓄有宇宙大自然之力量，其力量有吉凶者，
//亦类如天地有阴阳，物有刚柔表里，其理即同也。是故，组成号码的数字，各有字画之数理，各有各别之灵导力，是以发生吉凶，因而支配人之命运也。
//而号码秉有八十一灵动数之吉凶力者，乃五格之名数，互相接触，或抱合或反拨，而发生变化，非单一格，或两格之数理，就可以判断。
//须要考查各格之数，及综合全部之数理。考察其三才配置。细互较量以计算之，即能判断其吉凶也。

//凡是多于八十一数之数理，必须扣除八十而使其还本归元，便知该数之吉凶。

//如：八十一数也即相等于一数之吉凶；八十二数也即相等于二数之吉凶；八十三数也即相等于三数之吉凶；八十四数之吉凶与四数之看法同，余类推。
//号码与主人性格分析

//现今，不论是男女老幼，“手机”已经是每个人生活必备的随身物品之一。 手机号码作为一种随身数字符号，数理的灵动对用者来说，均有其内在的诱导及暗示力。 

//手机号码在很大程度上反映着号码持有人的个人性格和处世方式，反之，个人的一些性格特征也会潜移默化被号码本身蕴藏的灵动力有所改变。
//通过本站的手机号码与主人性格分析结果，您可以从中获得一些有价值的启迪。

//号码与主人性格分析测算原理：

//1、先将所属手机号码（如 83123456）分拆，然后逐个数目单一加起来。
//例：8+3+1+2+3+4+5+6=32

//2、得出结果32后（一般为两位数），再一次拆开计算。
//例：3+2=5

//如果加起来的总合仍然是两位数字，继续拆开加起来，直至成为单位数字为止。

//3、最后计出的个位数「5」，就是手机所属的命运数，详细情况参阅以下对照表：

//数字为1：要面包不要爱情----
//责任心重，尤其对工作充满热诚，是个彻头彻尾工作狂。但往往因为过分专注职务，而忽略身边的家人及朋友，是个宁要面包不需要爱情的理性主义者。

//数字为2：不善表达/疑心重----
//在乎身边各人对自己的评价及观感，不善表达个人情感，是个先考虑别人感受，再作出相应配合的内敛一族。对于爱侣，经常存有怀疑之心。

//数字为3：大胆行事冲动派----
//爱好追寻刺激，有不理后果大胆行事的倾向。崇尚自由奔放的恋爱，会拼尽全力爱一场，是就算明知无结果都在所不惜的冲动派。

//数字为4：高度戒备难交心----
//经常处于戒备状态，对任何事都没法放松处理，孤僻性情难以交朋结友。对于爱情，就更加会慎重处理。任何人必须经过长期观察及通过连番考验，方会减除戒备与你交往。

//数字为5：好奇心旺求知欲强---
//好奇心极度旺盛，求知欲又强，有打烂沙盘问到笃的锲而不舍精神。此外，你天生有语言天分，学习外文比一般人更易掌握。

//数字为6：做事喜好凭直觉----
//有特强的第六灵感，性格率直无机心，深得朋辈爱戴。感情路上多采多姿。做事喜好凭个人直觉及预感做决定。

//数字为7：独断独行/吸引人----
//为人独断独行，事事自行作主解决，鲜有求助他人。而这份独立个性，正正就是吸引异性的特质。但其实心底里，却是渴望有人可让他/她依赖。

//数字为8：热情/善变梦想家----
//对人热情无遮掩，时常梦想可以谈一场戏剧性恋爱，亲身体会个中悲欢离合的动人经历，是个大梦想家。但对于感情却易变卦。

//数字为9：自我牺牲/性格被动----
//习惯于无条件付出，从不祈求有回报，有为了成全他人不惜牺牲自己的情操。但讲到本身的爱情观，却流于被动，往往因为内敛而错过大好姻缘。

//更换新号说明

//如号码测算结果不佳，加之姓名三才配置配备不良，或本命流年运势波折，建议易号，使祥和愉悦之气随呼叫而来，可逢凶化吉。

//更改良号须经多少时间，型定方显奇效，符号之最大灵效，乃系在于使用 (呼唤) 而生，所以凶号只要不再呼唤而使用之，则凶亦退去而不来临。
//更改为良号，开始呼唤以使用之算起，号令天下，则吉祥数理随其呼叫而来，于常呼叫之间，而其灵动力就开始作用了，
//自然会招来幸福 (包括财源、安全、健康、感情、寿命在内，皆受良号之美好影响) 。
//而良号须使用三年，而又至少有三百人认识您这个新号，而后新号之善力至此才确告定型，并发挥战胜了旧号之凶力，至此时始得欣庆良好，新号已完全取代了旧号之位了。